[
  {"id":"movie01","text":"The Shawshank Redemption (1994) - Director: Frank Darabont. A wrongly convicted banker forms a friendship in prison and clings to hope over decades. Often ranked among the greatest films of all time."},
  {"id":"movie02","text":"The Godfather (1972) - Director: Francis Ford Coppola. A crime family saga about power, loyalty, and succession. Landmark in American cinema."},
  {"id":"movie03","text":"The Godfather Part II (1974) - Director: Francis Ford Coppola. Parallel stories of Vito Corleone's rise and Michael's reign. Celebrated for scope and depth."},
  {"id":"movie04","text":"The Dark Knight (2008) - Director: Christopher Nolan. Batman faces the Joker in a moral and psychological showdown. Known for its intense performances and scale."},
  {"id":"movie05","text":"12 Angry Men (1957) - Director: Sidney Lumet. A jury deliberation turns into a study of bias and reasonable doubt. Classic courtroom drama."},
  {"id":"movie06","text":"Schindler's List (1993) - Director: Steven Spielberg. A haunting account of the Holocaust and one man's efforts to save lives. Widely honored for its impact."},
  {"id":"movie07","text":"The Lord of the Rings: The Return of the King (2003) - Director: Peter Jackson. The epic conclusion to the trilogy, known for its scale and awards."},
  {"id":"movie08","text":"Pulp Fiction (1994) - Director: Quentin Tarantino. Interwoven crime stories with sharp dialogue and nonlinear storytelling. A defining 1990s film."},
  {"id":"movie09","text":"The Good, the Bad and the Ugly (1966) - Director: Sergio Leone. A sprawling spaghetti western about three men chasing buried gold. Iconic score and cinematography."},
  {"id":"movie10","text":"Fight Club (1999) - Director: David Fincher. A disillusioned narrator forms an underground fight club that spirals into chaos. Known for its twist and themes."},
  {"id":"movie11","text":"Forrest Gump (1994) - Director: Robert Zemeckis. A simple man unwittingly influences historic events. Beloved for its heart and performances."},
  {"id":"movie12","text":"Inception (2010) - Director: Christopher Nolan. A team enters dreams to steal and implant ideas. Famous for its layered structure and visuals."},
  {"id":"movie13","text":"The Matrix (1999) - Director: Lana and Lilly Wachowski. A hacker discovers reality is a simulation and joins a rebellion. Revolutionary action and concept."},
  {"id":"movie14","text":"Goodfellas (1990) - Director: Martin Scorsese. A rise and fall of a mob associate. Known for its pacing, narration, and authenticity."},
  {"id":"movie15","text":"Star Wars: Episode V - The Empire Strikes Back (1980) - Director: Irvin Kershner. The Rebels face a major setback as the saga deepens. Often considered the best in the series."},
  {"id":"movie16","text":"Parasite (2019) - Director: Bong Joon Ho. A darkly comic thriller about class divide and deception. First non-English Best Picture winner."},
  {"id":"movie17","text":"The Silence of the Lambs (1991) - Director: Jonathan Demme. An FBI trainee seeks help from a serial killer to catch another. A tense psychological thriller."},
  {"id":"movie18","text":"Seven Samurai (1954) - Director: Akira Kurosawa. Farmers hire ronin to defend their village. A foundational epic in world cinema."},
  {"id":"movie19","text":"City of God (2002) - Director: Fernando Meirelles and Katia Lund. A gripping look at crime in Rio de Janeiro's favelas. Known for its energy and realism."},
  {"id":"movie20","text":"The Green Mile (1999) - Director: Frank Darabont. A prison guard encounters a mysterious inmate with supernatural gifts. Emotional drama set on death row."}
]
